RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_i2c.h
#define    I2C_MSPBGR_MSPBGRH_Pos                                 (16U)
#define    I2C_MSPBGR_MSPBGRH_Msk                                 (0x1ffU << I2C_MSPBGR_MSPBGRH_Pos)
#define    I2C_MSPBGR_MSPBGRH                                     I2C_MSPBGR_MSPBGRH_Msk

#define    I2C_MSPBGR_MSPBGRL_Pos                                 (0U)
#define    I2C_MSPBGR_MSPBGRL_Msk                                 (0x1ffU << I2C_MSPBGR_MSPBGRL_Pos)
#define    I2C_MSPBGR_MSPBGRL                                     I2C_MSPBGR_MSPBGRL_Msk

#define    I2C_MSPBUF_MSPBUF_Pos                                  (0U)
#define    I2C_MSPBUF_MSPBUF_Msk                                  (0xffU << I2C_MSPBUF_MSPBUF_Pos)
#define    I2C_MSPBUF_MSPBUF                                      I2C_MSPBUF_MSPBUF_Msk

#define    I2C_MSPTCR_SDAHD_Pos                                   (0U)
#define    I2C_MSPTCR_SDAHD_Msk                                   (0x1ffU << I2C_MSPTCR_SDAHD_Pos)
#define    I2C_MSPTCR_SDAHD                                       I2C_MSPTCR_SDAHD_Msk

#define    I2C_MSPTOR_TIMEOUT_Pos                                 (0U)
#define    I2C_MSPTOR_TIMEOUT_Msk                                 (0xfffU << I2C_MSPTOR_TIMEOUT_Pos)
#define    I2C_MSPTOR_TIMEOUT                                     I2C_MSPTOR_TIMEOUT_Msk

#define    I2C_SSPCR_SCLSEN_Pos                                   (9U)
#define    I2C_SSPCR_SCLSEN_Msk                                   (0x1U << I2C_SSPCR_SCLSEN_Pos)
#define    I2C_SSPCR_SCLSEN                                       I2C_SSPCR_SCLSEN_Msk

#define    I2C_SSPCR_DMAEN_Pos                                    (8U)
#define    I2C_SSPCR_DMAEN_Msk                                    (0x1U << I2C_SSPCR_DMAEN_Pos)
#define    I2C_SSPCR_DMAEN                                        I2C_SSPCR_DMAEN_Msk

#define    I2C_SSPCR_ACKEN_Pos                                    (4U)
#define    I2C_SSPCR_ACKEN_Msk                                    (0x1U << I2C_SSPCR_ACKEN_Pos)
#define    I2C_SSPCR_ACKEN                                        I2C_SSPCR_ACKEN_Msk

#define    I2C_SSPCR_SDAO_DLYEN_Pos                               (3U)
#define    I2C_SSPCR_SDAO_DLYEN_Msk                               (0x1U << I2C_SSPCR_SDAO_DLYEN_Pos)
#define    I2C_SSPCR_SDAO_DLYEN                                   I2C_SSPCR_SDAO_DLYEN_Msk

#define    I2C_SSPCR_SCLI_ANFEN_Pos                               (2U)
#define    I2C_SSPCR_SCLI_ANFEN_Msk                               (0x1U << I2C_SSPCR_SCLI_ANFEN_Pos)
#define    I2C_SSPCR_SCLI_ANFEN                                   I2C_SSPCR_SCLI_ANFEN_Msk

#define    I2C_SSPCR_A10EN_Pos                                    (1U)
#define    I2C_SSPCR_A10EN_Msk                                    (0x1U << I2C_SSPCR_A10EN_Pos)
#define    I2C_SSPCR_A10EN                                        I2C_SSPCR_A10EN_Msk

#define    I2C_SSPCR_SSPEN_Pos                                    (0U)
#define    I2C_SSPCR_SSPEN_Msk                                    (0x1U << I2C_SSPCR_SSPEN_Pos)
#define    I2C_SSPCR_SSPEN                                        I2C_SSPCR_SSPEN_Msk

#define    I2C_SSPIER_ADEIE_Pos                                   (7U)
#define    I2C_SSPIER_ADEIE_Msk                                   (0x1U << I2C_SSPIER_ADEIE_Pos)
#define    I2C_SSPIER_ADEIE                                       I2C_SSPIER_ADEIE_Msk

#define    I2C_SSPIER_SIE_Pos                                     (6U)
#define    I2C_SSPIER_SIE_Msk                                     (0x1U << I2C_SSPIER_SIE_Pos)
#define    I2C_SSPIER_SIE                                         I2C_SSPIER_SIE_Msk

#define    I2C_SSPIER_PIE_Pos                                     (5U)
#define    I2C_SSPIER_PIE_Msk                                     (0x1U << I2C_SSPIER_PIE_Pos)
#define    I2C_SSPIER_PIE                                         I2C_SSPIER_PIE_Msk

#define    I2C_SSPIER_WCOLIE_Pos                                  (4U)
#define    I2C_SSPIER_WCOLIE_Msk                                  (0x1U << I2C_SSPIER_WCOLIE_Pos)
#define    I2C_SSPIER_WCOLIE                                      I2C_SSPIER_WCOLIE_Msk

#define    I2C_SSPIER_SSPOVIE_Pos                                 (3U)
#define    I2C_SSPIER_SSPOVIE_Msk                                 (0x1U << I2C_SSPIER_SSPOVIE_Pos)
#define    I2C_SSPIER_SSPOVIE                                     I2C_SSPIER_SSPOVIE_Msk

#define    I2C_SSPIER_ADMIE_Pos                                   (2U)
#define    I2C_SSPIER_ADMIE_Msk                                   (0x1U << I2C_SSPIER_ADMIE_Pos)
#define    I2C_SSPIER_ADMIE                                       I2C_SSPIER_ADMIE_Msk

#define    I2C_SSPIER_TXIE_Pos                                    (1U)
#define    I2C_SSPIER_TXIE_Msk                                    (0x1U << I2C_SSPIER_TXIE_Pos)
#define    I2C_SSPIER_TXIE                                        I2C_SSPIER_TXIE_Msk

#define    I2C_SSPIER_RXIE_Pos                                    (0U)
#define    I2C_SSPIER_RXIE_Msk                                    (0x1U << I2C_SSPIER_RXIE_Pos)
#define    I2C_SSPIER_RXIE                                        I2C_SSPIER_RXIE_Msk

#define    I2C_SSPISR_ADE_Pos                                    (7U)
#define    I2C_SSPISR_ADE_Msk                                    (0x1U << I2C_SSPISR_ADE_Pos)
#define    I2C_SSPISR_ADE                                        I2C_SSPISR_ADE_Msk

#define    I2C_SSPISR_S_Pos                                       (6U)
#define    I2C_SSPISR_S_Msk                                       (0x1U << I2C_SSPISR_S_Pos)
#define    I2C_SSPISR_S                                           I2C_SSPISR_S_Msk

#define    I2C_SSPISR_P_Pos                                       (5U)
#define    I2C_SSPISR_P_Msk                                       (0x1U << I2C_SSPISR_P_Pos)
#define    I2C_SSPISR_P                                           I2C_SSPISR_P_Msk

#define    I2C_SSPISR_WCOL_Pos                                    (4U)
#define    I2C_SSPISR_WCOL_Msk                                    (0x1U << I2C_SSPISR_WCOL_Pos)
#define    I2C_SSPISR_WCOL                                        I2C_SSPISR_WCOL_Msk

#define    I2C_SSPISR_SSPOV_Pos                                   (3U)
#define    I2C_SSPISR_SSPOV_Msk                                   (0x1U << I2C_SSPISR_SSPOV_Pos)
#define    I2C_SSPISR_SSPOV                                       I2C_SSPISR_SSPOV_Msk

#define    I2C_SSPISR_ADM_Pos                                     (2U)
#define    I2C_SSPISR_ADM_Msk                                     (0x1U << I2C_SSPISR_ADM_Pos)
#define    I2C_SSPISR_ADM                                         I2C_SSPISR_ADM_Msk

